Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions.OutputFolder
The path of the output folder for systems analysis.
Remarks:
When requesting a new system analysis, it is okay to have an empty output folder in the SystemsAnalysisOption. In that case,
the ViewSystemsAnalysisReport would supply the output folder, typically at the system TEMP folder.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The analysis requires a valid output folder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions.WeatherFile
The file name of the EnergyPlus weather (*.epw).
Remarks:
When requesting a new system analysis, it is okay to have an empty weather file in the SystemsAnalysisOption. In that case,
the ViewSystemsAnalysisReport would use the weather file at the current site location.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The analysis requires a valid EnergyPlus weather (.epw) file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions.WorkflowFile
The file name of the EnergyPlus workflow script.
Remarks:
When requesting a new system analysis, it is okay to have an empty workflowFile in the SystemsAnalysisOption. In that case,
the ViewSystemsAnalysisReport would supply the weather file with the default value "HVAC Systems Loads and Sizing.osw".
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The analysis requires a valid workflow file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2020.1